java-tests/ws/ws-cxf/src/test/resources/results/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns2:getCustomersByName xmlns:ns2="http://customerservice.example.com/">
            <name>Smith</name>
        </ns2:getCustomersByName>
    </soap:Body>
</soap:Envelope>
